{
    "laws" : [
        { "name" : "Law 1: - The Ground",
          "content" : [ {"section" : "Definitions",
                         "sectioncontents": [
                                    { "type": "image",
                                      "value" : "the_plan_may2013"},
                                    { "type": "image",
                                      "value" : "playing_enclosure_en"
                                    },
                                    { "type": "definition",
                                      "value":"<b>DEFINITIONS</b><br /><br /><b>The Ground</b> is the total area shown on the plan. The Ground includes:<br /><br /><b>The Field of play</b> is the area (as shown on the plan) between the goal lines and the touchlines. These lines are not part of the field of play.<br /><br /><b>The Playing Area</b> is the field of play and the in-goal areas (as shown on the plan). The touchlines, touch-in-goal lines and dead ball lines are not part of the playing area.<br /><br /><b>The Playing Enclosure</b> is the playing area and a space around it, not less than 5 metres where practicable, which is known as the perimeter area.<br /><br /><b>In-goal</b> is the area between the goal line and the dead ball line, and between the touch-in-goal lines. It includes the goal line but it does not include the dead ball line or the touch-in-goal lines.<br /><br /><b>‘The 22’</b> is the area between the goal line and the 22-metre line, including the 22-metre line but excluding the goal line.<br /><br /><b>The Plan,</b> including all the words and figures on it, is part of the Laws."
                                    }]
                         },
                         {"section" : "1.1 Surface of the playing enclosure",
                         "sectioncontents" :[
                                    { "type" : "sectionheader",
                                      "value" :""},
                                    { "type" : "text",
                                      "value" : "(a) <b>Requirement.</b> The surface must be safe to play on at all times.<br /><br />(b) <b>Type of surface.</b> The surface should be grass but may also be sand, clay, snow or artificial grass. The game may be played on snow, provided the snow and underlying surface are safe to play on. It shall not be a permanently hard surface such as concrete or asphalt. In the case of artificial grass surfaces, they must conform to IRB Regulation 22."
                                    }]
                         },
                         {"section" : "1.2 Required dimensions for the playing enclosure",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""                                      
                                    },
                                    { "type" : "text",
                                      "value" :"(a) <b>Dimensions.</b> The field of play does not exceed 100 metres in length. Each in-goal does not exceed 22 metres in length. The playing area does not exceed 70 metres in width.<br/><br/>(b) The length and breadth of the playing area are to be as near as possible to the dimensions indicated. All the areas are rectangular.<br/><br/>(c) The distance from the goal line to the dead ball line will preferably be not less than 10 metres.<br/><br/>(d)In respect of:<br/><br/>&emsp;(i) Matches between the senior national representative team or the next senior national representative team of a Union against the senior or next senior national representative team of another Union; and<br/><br/>&emsp;(ii) International seven-a-side matches;<br/><br/>&emsp;the dimensions should be as close to the maximum sizes as possible, and not less than 94 metres in length for the field of play, 68 metres in width, and with a minimum in-goal length of 6 metres. Unions wishing to vary minimum or maximum dimensions should apply for dispensation to the IRB.<br/><br/>(e) The perimeter area should not be less than 5 metres where practicable."
                                    }]
                         },
                         {"section" : "1.3 Lines on the playing enclosure",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Solid Lines</b><br/><br/>The dead ball lines and touch-in-goal lines, both of which are outside the in-goal areas;<br/><br/>The goal lines, which are within the in-goal areas but outside the field of play;<br/><br/>The 22-metre lines; which are parallel to the goal lines<br/><br/>The half way line which is parallel to the goal lines; and<br/><br/>The touchlines which are outside the field of play."
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Dash Lines</b><br/><br/>All lines other than solid lines are dash lines all of which are 5 metres in length.<br/><br/>There are two sets of dash lines which are 10 metres from, and parallel to, each side of the half way line. These are called the 10 metre dash lines. The 10 metre dash lines intersect the dash lines which are 5 metres and 15 metres parallel to each touch line.<br/><br/>There are two sets of dash lines which are 5 metres from, and parallel to, each touch line. They run from the 5 metre dash lines, which are parallel to each goal line and intersect both 22 metre lines, both 10 metre dash lines and the half way line. These are called the 5 metre dash lines.<br/><br/>There are two sets of dash lines which are 15 metres from, and parallel to, each touch line. These dash lines run from the 5 metre dash lines which are parallel to each goal line, and intersect both 22 metre lines, both 10 metre dash lines and the half way line. These are called the 15 metre dash lines.<br/><br/>There are six dash lines 5 metres from, and parallel to, each goal line. Two dash lines are positioned 5 metres and 15 metres from each touch line. A further two dash lines are positioned in front of each goal post so that there is 5 metres between these dash lines."
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Centre</b><br/><br/>There is one line 0.5 metre long that intersects the centre of the half way line."                                     
                                    }]
                         },
                         {"section" : "1.4 Dimensions for goal posts and crossbar",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "image",
                                      "value" : "goal_posts_en"
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The distance between the two goal posts is 5.6 metres.<br/><br/>(b) The crossbar is placed between the two goal posts so that its top edge is 3.0 metres from the ground.<br/><br/>(c) The minimum height of the goal posts is 3.4 metres.<br/><br/>(d) When padding is attached to the goal posts the distance from the goal line to the external edge of the padding must not exceed 300mm."
                                    }]
                         },
                         {"section" : "1.5 Flag posts",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""                                    
                                    },
                                    { "type" : "text",
                                      "value" : "(a) There are 14 flag posts with flags, each with a minimum height of 1.2 metres above the ground.<br/><br/>(b) Flag posts must be positioned at the intersection of touch-in-goal lines and the goal lines and at the intersection of the touch-in-goal lines and the dead ball lines. These eight flag posts are outside the in-goal area and do not form part of the playing area.<br/><br/>(c) Flag posts must be positioned in line with the 22-metre lines and the half way line, 2 metres outside the touchlines and within the playing enclosure."
                                    }]
                         },
                         {"section" : "1.6 Objections to the ground",
                          "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) If either team has objections about the ground or the way it is marked out they must tell the referee before the match starts.<br/><br/>(b) The referee will attempt to resolve the issues but must not start a match if any part of the ground is considered to be dangerous."
                                    }]
                          }]
        },
        { "name": "Law 2: - The Ball",
          "content" : [
                      { "section" : "2.1 Shape",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The ball must be oval and made of four panels."
                                    }]
                      },
                      { "section" : "2.2 Dimensions",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "image",
                                      "value" : "table"
                                    },
                                    { "type" : "image",
                                      "value" : "ball_size_en"
                                    }]
                      },
                      { "section" : "2.3 Materials",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "Leather or suitable synthetic material. It may be treated to make it water resistant and easier to grip."
                                    }]
                      },
                      { "section" : "2.4 Weight",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "410 - 460 grams"
                                    }]
                      },
                      { "section" : "2.5 Air pressure at the start of play",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "65.71-68.75 kilopascals, or 0.67-0.70 kilograms per square centimetre, or 9.5-10.0 lbs per square inch."
                                    }]
                      },
                      { "section" : "2.6 Spare balls",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "Spare balls may be available during a match, but a team must not gain or attempt to gain an unfair advantage by using them or changing them."
                                    }]
                      },
                      { "section" : "2.7 Smaller balls",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "Balls of different sizes may be used for matches between young players."
                                    }]
                      }
                    ]
        },
        { "name" : "Law 3: - Number of Player - The Team",
          "content": [
                     { "section" : "Definitions",
                       "sectioncontents" : [
                                { "type" : "definition",
                                  "value" : "<b>DEFINITIONS<b><br/><br/><b>A Team</b>. A team consists of fifteen players who start the match plus any authorised replacements and/or substitutes.<br/><br/><b>Replacement.</b> A player who replaces an injured team-mate.<br/><br/><b>Substitute.</b> A player who replaces a team-mate for tactical reasons."
                                }]
                     },
                     { "section" : "3.1 Maximum number of players on the playing area",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""                                
                                },
                                { "type" : "text",
                                  "value" : "Maximum: each team must have no more than fifteen players on the playing area during play."
                                }]
                     },
                     { "section" : "3.2 Team with more than the permitted number of players",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "<b>Objection</b>: at any time before or during a match a team may make an objection to the referee about the number of players in their opponents’ team. As soon as the referee knows that a team has too many players, the referee must order the captain of that team to reduce the number appropriately. The score at the time of the objection remains unaltered.<br/><br/><font color=\"red\"><b>Sanction:</b> Penalty at the place where the match would restart.</font>"
                                }]
                     },
                     { "section" : "3.3 When there are fewer than fifteen players",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A Union may authorise matches to be played with fewer than fifteen players in each team. When that happens, all the Laws of the Game apply except that each team must have at least five players in the scrum at all times.<br/><br/><b>Exception:</b> matches between teams of Seven-a-side are an exception. These matches are covered by the Seven-a-side Variations to the Laws of the Game."
                                }]
                     },
                     { "section" : "3.4 Players nominated as substitutes",
                       "sectioncontents" : []
                     },
                     { "section" : " 3.5 The front row - replacements and substitutions",
                       "sectioncontents" : []
                     },
                     { "section" : "3.6 Sent off the field for foul play",
                       "sectioncontents" : []
                     },
                     { "section" : "3.7 Permanent replacement",
                       "sectioncontents" : []
                     },
                     { "section" : "3.8 The decision for permanent replacement",
                       "sectioncontents" : []
                     },
                     { "section" : "3.9 The referee’s power to stop an injured player from continuing",
                       "sectioncontents" : []
                     },
                     { "section" : "3.10 Temporary replacement",
                       "sectioncontents" : []
                     },
                     { "section" : "3.11 Player wishing to rejoin the match",
                       "sectioncontents" : []
                     },
                     { "section" : "3.12 Substituted players rejoining the match",
                       "sectioncontents" : []
                     },
                     { "section" : "3.13 Rolling substitutions",
                       "sectioncontents" :[]
                     }]
        },
        { "name" : "Law 4: - Players' Clothing",
          "content" : [
                      { "section" : "Definitions",
                        "sectioncontents" : []
                      },
                      { "section" : "4.1 Additional items of clothing",
                        "sectioncontents" : []
                      },
                      { "section" : "4.2 Special additional items for women",
                        "sectioncontents" : []
                      },
                      { "section" : "4.3 Studs",
                        "sectioncontents" : []
                      },
                      { "section" : "4.4 Banned items of clothing",
                        "sectioncontents" : []
                      },
                      { "section" : "4.4 Banned items of clothing",
                        "sectioncontents" : []
                      },
                      { "section" : "4.5 Inspection of players’ clothing",
                        "sectioncontents" : []
                      },
                      { "section" : "4.6 Wearing other clothing",
                        "sectioncontents" : []
                      }]
        },
        { "name" : "Law 5: - Time",
          "content" : [
                      { "section" : "5.1 Duration of a match",
                        "sectioncontents" : []
                      },
                      { "section" : "5.2 Half-time",
                        "sectioncontents" : []
                      },
                      { "section" : "5.3 Time keeping",
                        "sectioncontents" : []
                      },
                      { "section" : "5.4 Time lost",
                        "sectioncontents" : []
                      },
                      { "section" : "5.5 Making up for time lost",
                        "sectioncontents" : []
                      },
                      { "section" : "5.6 Playing extra time",
                        "sectioncontents" : []
                      },
                      { "section" : "5.7 Other time regulations",
                        "sectioncontents" : []
                      }]
        },
        { "name" : "Law 6: - Match Officials",
          "content" : [
                      { "section" : "Definitions",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A REFEREE",
                        "sectioncontents" : []
                      },
                      { "section" : "Before the match",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.1 Appointing the referee",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.2 Replacing the referee",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.3 Duties of the referee before the match",
                        "sectioncontents" : []
                      },
                      { "section" : "During the Match",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.4 The duties of the referee in the playing enclosure",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.5 Entering or leaving the playing area",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.6 Referee altering a decision",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.7 Referee consulting with others",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.8 The referee’s whistle",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.9 The referee and injury",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.10 The ball touching the referee",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.11 The ball in in-goal touched by non-player",
                        "sectioncontents" : []
                      },
                      { "section" : "After the match",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.12 Score",
                        "sectioncontents" : []
                      },
                      { "section" : "6.A.13 Player sent-off",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B TOUCH JUDGES AND ASSISTANT REFEREES",
                        "sectioncontents" : []
                      },
                      { "section" : "Before the match",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.1 Appointing touch judges and assistant referees",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.2 Replacing a touch judge or assistant referee",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.3 Control of touch judges and assistant referees",
                        "sectioncontents" : []
                      },
                      { "section" : "During the match",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.4 Where the touch judges or assistant referees should be",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.5 Touch judge or assistant referee signals",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.6 After signalling foul play",
                        "sectioncontents" : []
                      },
                      { "section" : "After the match",
                        "sectioncontents" : []
                      },
                      { "section" : "6.B.7 Player sent-off",
                        "sectioncontents" : []
                      },
                      { "section" : "6.C ADDITIONAL PERSONS",
                        "sectioncontents" : []
                      },
                      { "section" : "6.C.1 Reserve touch judge or assistant referee",
                        "sectioncontents" : []
                      },
                      { "section" : "6.C.2 Those who may enter the playing area",
                        "sectioncontents" : []
                      },
                      { "section" : "6.C.3 Limits to entering the playing area",
                        "sectioncontents" : []
                      }]
        }
    ]
}