{
    "laws" : [
        { "name" : "Law 1: - The Ground",
          "content" : [ {"section" : "Definitions",
                         "sectioncontents": [
                                    { "type": "image",
                                      "value" : "the_plan_may2013"},
                                    { "type": "image",
                                      "value" : "playing_enclosure_en"
                                    },
                                    { "type": "definition",
                                      "value":"<b>DEFINITIONS</b><br /><br /><b>The Ground</b> is the total area shown on the plan. The Ground includes:<br /><br /><b>The Field of play</b> is the area (as shown on the plan) between the goal lines and the touchlines. These lines are not part of the field of play.<br /><br /><b>The Playing Area</b> is the field of play and the in-goal areas (as shown on the plan). The touchlines, touch-in-goal lines and dead ball lines are not part of the playing area.<br /><br /><b>The Playing Enclosure</b> is the playing area and a space around it, not less than 5 metres where practicable, which is known as the perimeter area.<br /><br /><b>In-goal</b> is the area between the goal line and the dead ball line, and between the touch-in-goal lines. It includes the goal line but it does not include the dead ball line or the touch-in-goal lines.<br /><br /><b>‘The 22’</b> is the area between the goal line and the 22-metre line, including the 22-metre line but excluding the goal line.<br /><br /><b>The Plan,</b> including all the words and figures on it, is part of the Laws."
                                    }]
                         },
                         {"section" : "1.1 Surface of the playing enclosure",
                         "sectioncontents" :[
                                    { "type" : "sectionheader",
                                      "value" :""},
                                    { "type" : "text",
                                      "value" : "(a) <b>Requirement.</b> The surface must be safe to play on at all times.<br /><br />(b) <b>Type of surface.</b> The surface should be grass but may also be sand, clay, snow or artificial grass. The game may be played on snow, provided the snow and underlying surface are safe to play on. It shall not be a permanently hard surface such as concrete or asphalt. In the case of artificial grass surfaces, they must conform to IRB Regulation 22."
                                    }]
                         },
                         {"section" : "1.2 Required dimensions for the playing enclosure",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""                                      
                                    },
                                    { "type" : "text",
                                      "value" :"(a) <b>Dimensions.</b> The field of play does not exceed 100 metres in length. Each in-goal does not exceed 22 metres in length. The playing area does not exceed 70 metres in width.<br/><br/>(b) The length and breadth of the playing area are to be as near as possible to the dimensions indicated. All the areas are rectangular.<br/><br/>(c) The distance from the goal line to the dead ball line will preferably be not less than 10 metres.<br/><br/>(d)In respect of:<br/><br/>&emsp;(i) Matches between the senior national representative team or the next senior national representative team of a Union against the senior or next senior national representative team of another Union; and<br/><br/>&emsp;(ii) International seven-a-side matches;<br/><br/>&emsp;the dimensions should be as close to the maximum sizes as possible, and not less than 94 metres in length for the field of play, 68 metres in width, and with a minimum in-goal length of 6 metres. Unions wishing to vary minimum or maximum dimensions should apply for dispensation to the IRB.<br/><br/>(e) The perimeter area should not be less than 5 metres where practicable."
                                    }]
                         },
                         {"section" : "1.3 Lines on the playing enclosure",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Solid Lines</b><br/><br/>The dead ball lines and touch-in-goal lines, both of which are outside the in-goal areas;<br/><br/>The goal lines, which are within the in-goal areas but outside the field of play;<br/><br/>The 22-metre lines; which are parallel to the goal lines<br/><br/>The half way line which is parallel to the goal lines; and<br/><br/>The touchlines which are outside the field of play."
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Dash Lines</b><br/><br/>All lines other than solid lines are dash lines all of which are 5 metres in length.<br/><br/>There are two sets of dash lines which are 10 metres from, and parallel to, each side of the half way line. These are called the 10 metre dash lines. The 10 metre dash lines intersect the dash lines which are 5 metres and 15 metres parallel to each touch line.<br/><br/>There are two sets of dash lines which are 5 metres from, and parallel to, each touch line. They run from the 5 metre dash lines, which are parallel to each goal line and intersect both 22 metre lines, both 10 metre dash lines and the half way line. These are called the 5 metre dash lines.<br/><br/>There are two sets of dash lines which are 15 metres from, and parallel to, each touch line. These dash lines run from the 5 metre dash lines which are parallel to each goal line, and intersect both 22 metre lines, both 10 metre dash lines and the half way line. These are called the 15 metre dash lines.<br/><br/>There are six dash lines 5 metres from, and parallel to, each goal line. Two dash lines are positioned 5 metres and 15 metres from each touch line. A further two dash lines are positioned in front of each goal post so that there is 5 metres between these dash lines."
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Centre</b><br/><br/>There is one line 0.5 metre long that intersects the centre of the half way line."                                     
                                    }]
                         },
                         {"section" : "1.4 Dimensions for goal posts and crossbar",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "image",
                                      "value" : "goal_posts_en",
                                      "extras" : "<b>Goal posts</b>"
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The distance between the two goal posts is 5.6 metres.<br/><br/>(b) The crossbar is placed between the two goal posts so that its top edge is 3.0 metres from the ground.<br/><br/>(c) The minimum height of the goal posts is 3.4 metres.<br/><br/>(d) When padding is attached to the goal posts the distance from the goal line to the external edge of the padding must not exceed 300mm."
                                    }]
                         },
                         {"section" : "1.5 Flag posts",
                          "sectioncontents": [
                                    { "type" : "sectionheader",
                                      "value" : ""                                    
                                    },
                                    { "type" : "text",
                                      "value" : "(a) There are 14 flag posts with flags, each with a minimum height of 1.2 metres above the ground.<br/><br/>(b) Flag posts must be positioned at the intersection of touch-in-goal lines and the goal lines and at the intersection of the touch-in-goal lines and the dead ball lines. These eight flag posts are outside the in-goal area and do not form part of the playing area.<br/><br/>(c) Flag posts must be positioned in line with the 22-metre lines and the half way line, 2 metres outside the touchlines and within the playing enclosure."
                                    }]
                         },
                         {"section" : "1.6 Objections to the ground",
                          "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) If either team has objections about the ground or the way it is marked out they must tell the referee before the match starts.<br/><br/>(b) The referee will attempt to resolve the issues but must not start a match if any part of the ground is considered to be dangerous."
                                    }]
                          }]
        },
        { "name": "Law 2: - The Ball",
          "content" : [
                      { "section" : "2.1 Shape",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The ball must be oval and made of four panels."
                                    }]
                      },
                      { "section" : "2.2 Dimensions",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "image",
                                      "value" : "table"
                                    },
                                    { "type" : "image",
                                      "value" : "ball_size_en"
                                    }]
                      },
                      { "section" : "2.3 Materials",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "Leather or suitable synthetic material. It may be treated to make it water resistant and easier to grip."
                                    }]
                      },
                      { "section" : "2.4 Weight",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "410 - 460 grams"
                                    }]
                      },
                      { "section" : "2.5 Air pressure at the start of play",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "65.71-68.75 kilopascals, or 0.67-0.70 kilograms per square centimetre, or 9.5-10.0 lbs per square inch."
                                    }]
                      },
                      { "section" : "2.6 Spare balls",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "Spare balls may be available during a match, but a team must not gain or attempt to gain an unfair advantage by using them or changing them."
                                    }]
                      },
                      { "section" : "2.7 Smaller balls",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "Balls of different sizes may be used for matches between young players."
                                    }]
                      }
                    ]
        },
        { "name" : "Law 3: - Number of Player - The Team",
          "content": [
                     { "section" : "Definitions",
                       "sectioncontents" : [
                                { "type" : "definition",
                                  "value" : "<b>DEFINITIONS<b><br/><br/><b>A Team</b>. A team consists of fifteen players who start the match plus any authorised replacements and/or substitutes.<br/><br/><b>Replacement.</b> A player who replaces an injured team-mate.<br/><br/><b>Substitute.</b> A player who replaces a team-mate for tactical reasons."
                                }]
                     },
                     { "section" : "3.1 Maximum number of players on the playing area",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""                                
                                },
                                { "type" : "text",
                                  "value" : "Maximum: each team must have no more than fifteen players on the playing area during play."
                                }]
                     },
                     { "section" : "3.2 Team with more than the permitted number of players",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "<b>Objection</b>: at any time before or during a match a team may make an objection to the referee about the number of players in their opponents’ team. As soon as the referee knows that a team has too many players, the referee must order the captain of that team to reduce the number appropriately. The score at the time of the objection remains unaltered.<br/><br/><font color=\"red\"><b>Sanction:</b> Penalty at the place where the match would restart.</font>"
                                }]
                     },
                     { "section" : "3.3 When there are fewer than fifteen players",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A Union may authorise matches to be played with fewer than fifteen players in each team. When that happens, all the Laws of the Game apply except that each team must have at least five players in the scrum at all times.<br/><br/><b>Exception:</b> matches between teams of Seven-a-side are an exception. These matches are covered by the Seven-a-side Variations to the Laws of the Game."
                                }]
                     },
                     { "section" : "3.4 Players nominated as substitutes",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) For international matches a Union may nominate up to eight replacements/substitutes.<br/><br/>(b) For other matches, the Union or match organiser with jurisdiction over the match decides how many replacements/substitutes may be nominated to a maximum of eight.<br/><br/>(c) A Union (or Unions, where a match or competition is played between teams from two or more Unions) may decide how many replacements/substitutes may be nominated to a maximum of eight.<br/><br/>(d) A team can substitute up to two front row players (subject to Law 3.5 (f) and (g) when it may be three) and up to five other players.<br/><br/>(e) Substitutions may only be made when the ball is dead and with the permission of the referee.<br/><br/>"
                                }]
                     },
                     { "section" : "3.5 The front row - replacements and substitutions",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) The table below indicates the numbers of suitably trained and experienced players available for the front row when nominating different numbers of players"
                                },
                                { "type" : "image",
                                  "value" : "players_table"
                                },
                                { "type" : "text",
                                  "value" : "(b) Prior to the match teams must advise the referee of their front row players and replacements. Each player in the front row and any potential replacements must be suitably trained and experienced.<br/><br/>(c) The replacement of a front row player must come from the suitably trained and experienced players who started the match or from nominated replacements. A player other than a nominated front row player is permitted to play in the front row only when uncontested scrums are being played and there are no available front row replacements.<br/><br/>(d) A suitably trained and experienced front row forward may start the match in another position."
                                },
                                { "type" : "text",
                                  "value" : "(e) When 19, 20, 21 or 22 players are nominated in a team there must be five players who can play in the front row to ensure that:<br/><br/>&emsp;- on the first occasion that a replacement hooker is required the team can continue to play safely with contested scrums<br/><br/>&emsp;- on the first occasion that a replacement prop is required the team can continue to play safely with contested scrums."
                                },
                                { "type" : "text",
                                  "value" : "(f) The Union having jurisdiction over a match or a match organiser may decide that when 22 players are nominated in a team there must be sufficient front row players to play at hooker, tight-head prop and loose-head prop who are suitably trained and experienced to ensure that on the first occasion that a replacement is required in each front row position, the team can continue to play safely with contested scrums.<br/><br/>(g) If a Union or match organiser decides to have 23 players nominated for a team there must be sufficient front row players to play at hooker, tight-head prop and loose-head prop who are suitably trained and experienced to ensure that on the first occasion that a replacement is required in each front row position, the team can continue to play safely with contested scrums. If a team is only able to nominate two suitably trained front row players then only 22 players may be nominated for the match.<br/><br/>(h) If, because of a sending off or injury, a team cannot provide enough suitably trained front row players, the match continues with uncontested scrums.<br/><br/>(i) If a team does not have suitably trained front row players prior to the match so that contested scrums cannot take place the referee will order uncontested scrums. The referee will report the matter to the match organiser."
                                },
                                { "type" : "text",
                                  "value" : "(j) A match organiser may decide within the competition rules that a match may or may not commence if suitably trained and experienced front row players are not available so that contested scrums cannot take place.<br/><br/>(k) When 23 players are nominated for a match, or if the Union having jurisdiction over a match or a match organiser decides that where uncontested scrums are ordered as a result of there being no suitably trained and experienced front row replacement for any reason the team concerned shall not be entitled to replace the player whose departure caused uncontested scrums.<br/><br/>(l) If the referee orders uncontested scrums during a match - as a result of a team not having suitably trained and experienced front row players in compliance with Law or reasons of safety - the referee will report the matter to the match organiser."
                                },
                                { "type" : "text",
                                  "value" : "(m) If there are no further front row replacements available when a front row player leaves the field of play, is sent off or temporarily suspended, uncontested scrums will be ordered. It is not the responsibility of the referee to determine the suitability of trained front row replacements nor their availability, as this is a team responsibility.<br/><br/>(n) After a front row player leaves the field of play or is sent off, or during the time for which a front row player is temporarily suspended, the referee, upon awarding the next scrum, will ask the player’s captain whether or not the team has another player on the playing area who is suitably trained and experienced to play in the front row. If not, the captain chooses another player on the playing area who then must leave the playing area to be replaced by a suitably trained and experienced front row player from the team’s replacements. The captain may do this when the scrum is ordered or after another player has been tried in the front row.<br/><br/>(o) When a period of temporary suspension ends and a front row player returns to the playing area, the replacement front row player leaves the field of play and the nominated player who left the playing area for the period of suspension may resume playing in the match."
                                },
                                { "type" : "text",
                                  "value" : "(p) If a front row player is temporarily suspended and the replacement player is sent off, the temporarily suspended front row player may return to the playing area after the period of suspension but the player who was nominated to leave the playing area must not return to the playing area for the duration of the match except as a substitute or replacement for another player.<br/><br/>(q) If a front row player is temporarily replaced and the replacement player is sent off, the temporarily replaced player may return to the field of play at the time the next scrum is awarded after the sending off providing it is within 15 minutes (actual time) from the time the player left the playing area. The captain of that team chooses another player on the playing area who then must leave the playing area.<br/><br/>(r) A previously substituted front row player is permitted to replace a front row player who is injured, temporarily suspended, or sent off if the replacement will ensure that scrums remain contested."
                                },
                                { "type" : "text",
                                  "value" : "(s) If uncontested scrums have been ordered and there is an injury to a front row player which requires that player to be replaced and there is a front row replacement available, then the front row replacement must be used rather than other players.<br/><br/>(t) If uncontested scrums have been ordered and a team has utilised all its permitted replacements/ substitutes and a front row player is then injured, that player cannot be replaced."
                                }]
                     },
                     { "section" : "3.6 Sent off the field for foul play",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A player sent off for foul play must not be replaced or substituted. For an exception to this Law, refer to Law 3.5."
                                }]
                     },
                     { "section" : "3.7 Permanent replacement",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A player may be permanently replaced if injured. If the player is permanently replaced, that player must not return and play in that match. The replacement of the injured player must be made when the ball is dead and with the permission of the referee."
                                }]
                     },
                     { "section" : "3.8 The decision for permanent replacement",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) When a national representative team is playing in a match, a player may be replaced only when, in the opinion of a doctor, the player is so injured that it would be unwise for that player to continue playing in that match.<br/><br/>(b) In other matches, where a Union has given explicit permission, an injured player may be replaced on the advice of a medically trained person. If none is present, that player may be replaced if the referee agrees."
                                }]
                     },
                     { "section" : "3.9 The referee’s power to stop an injured player from continuing",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "If the referee decides – with or without the advice of a doctor or other medically qualified person – that a player is so injured that the player should stop playing, the referee may order that player to leave the playing area. The referee may also order an injured player to leave the field in order to be medically examined."
                                }]
                     },
                     { "section" : "3.10 Temporary replacement",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) When a player has a blood injury, which has uncontrolled active bleeding (a blood injury), that player may be temporarily replaced. The injured player must return to play as soon as the bleeding has been controlled and/or covered. If the player who has been temporarily replaced is not available to return to the field of play within 15 minutes (actual time) of leaving the playing area, the replacement becomes permanent and the replaced player must not return to the field of play."
                                },
                                { "type" : "video",
                                  "value" : "http://www.irblaws.com/videos/laws/2001-bleeding-controlled.mp4"
                                },
                                { "type" : "text",
                                  "value" : "(b) In international matches, the Match Day Doctor shall decide whether an injury is a blood injury necessitating a temporary replacement."
                                },
                                { "type" : "text",
                                  "value" : "(c) Minor cuts and abrasions not constituting a blood injury should be treated during stoppages in play for other reasons.<br/><br/>(d) If the temporary replacement is injured, that player may also be replaced.<br/><br/>(e) If the temporary replacement is sent off for foul play, the replaced player may not return to the field of play.<br/><br/>(f) If the temporary replacement is cautioned and temporarily suspended, the replaced player may not return to the field of play until after the period of suspension."
                                },
                                { "type" : "amendment",
                                  "value" : "<font color=\"red\"><b><i>LAW AMENDMENT TRIAL</i></b></font><br/><br/><b>Temporary replacement - head injury assessment<br/><br/>In all situations, if there are any indications of concussion a player MUST be removed from play. This is known as Recognise and Remove.<br/><br/>For tournaments and matches approved by the Union or Rugby body having jurisdiction and with trained healthcare professionals, a temporary replacement may be used for a player who has a head injury where the diagnosis is unclear.</b><br/><br/>(a) When a player leaves the field to have a head injury assessment that player may be temporarily replaced. If the player who has been temporarily replaced does not return to the field of play within ten minutes (actual time) of leaving the playing area, the replacement becomes permanent and the replaced player must not return to the field of play.<br/><br/>(b) The player must be presented to a match official on the touchline within the prescribed time period.<br/><br/>(c) If a head injury assessment starts within ten minutes of half time, the player must return to play immediately after half time or the replacement becomes permanent.<br/><br/>(d) A player who temporarily replaces a player who is being assessed at the pitch side for head injury must not take penalty kicks at goal or conversion kicks.<br/><br/>(e) If the temporary replacement is injured, that player may also be replaced.<br/><br/>(f) If the temporary replacement is sent off for foul play, the replaced player may not return to the field of play.<br/><br/>(g) If the temporary replacement is cautioned and temporarily suspended, the replaced player may not return to the field of play until after the period of suspension."
                                }]
                     },
                     { "section" : "3.11 Player wishing to rejoin the match",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) A player who has a blood injury which has uncontrolled active bleeding must leave the playing area. The player must not return until the bleeding is controlled and the wound has been covered.<br/><br/>(b) A player who leaves a match because of injury or any other reason must not rejoin the match until the referee permits the player to return. The referee must not let a player rejoin a match until the ball is dead.<br/><br/>(c) If a player rejoins or a replacement/substitute joins the match without the referee’s permission, and the referee believes the player did so to help that player’s team or obstruct the opposing team, the referee penalises the player for misconduct.<br/><font color=\"red\"><b>Sanction:</b> A penalty kick is awarded at the place where play would restart.</font>"
                                }]
                     },
                     { "section" : "3.12 Substituted players rejoining the match",
                       "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "If a player is substituted, that player may only return to play when replacing a player with a blood injury or for an injured front row player in accordance with Law 3.5."
                                }]
                     },
                     { "section" : "3.13 Rolling substitutions",
                       "sectioncontents" :[
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A Union may implement rolling substitutions at defined levels of the Game within its jurisdiction. The number of substitutions must not exceed twelve. The administration and rules relating to rolling substitutions are the responsibility of the Union having jurisdiction."
                                }]
                     }]
        },
        { "name" : "Law 4: - Players' Clothing",
          "content" : [
                      { "section" : "Definitions",
                        "sectioncontents" : [
                                { "type" : "definition",
                                  "value" : "<b>DEFINITIONS</b><br/><br/><b>Players’ clothing</b> is anything players wear.<br/><br/>A player wears a jersey, shorts and underwear, socks and boots.<br/><br/>Detailed information relating to the permitted specifications for clothing and studs maybe found in IRB Specifications (Regulation 12)."
                                }]
                      },
                      { "section" : "4.1 Additional items of clothing",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) A player may wear supports made of elasticated or compressible materials which must be washable.<br/><br/>(b) A player may wear shin guards which conform with IRB Specifications (Regulation 12).<br/><br/>(c) A player may wear ankle supports worn under socks, not extending higher than one third of the length of the shin and, if rigid, from material other than metal.<br/><br/>(d) A player may wear mitts (fingerless gloves) which must conform to IRB Specifications (Regulation 12).<br/><br/>(e) A player may wear shoulder pads which must bear the IRB Approval Mark (Regulation 12).<br/><br/>(f) A player may wear a mouth guard or dental protector.<br/><br/>(g) A player may wear headgear which must bear the IRB Approval Mark (Regulation 12).<br/><br/>(h) A player may wear bandages and/or dressings to cover or protect any injury.<br/><br/>(i) A player may wear thin tape or other similar material as support and/or to prevent injury."
                                }]
                      },
                      { "section" : "4.2 Special additional items for women",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "In addition to the previously permitted clothing women may wear:<br/><br/>(a) Chest pads, which must bear the IRB Approval Mark (Regulation 12).<br/><br/>(b) Cotton blend long tights, with single inside leg seam under their shorts & socks.<br/><br/>(c) Headscarves, providing they do not cause a danger to the wearer or other players and do not contravene Regulation 12."
                                }]
                      },
                      { "section" : "4.3 Studs",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) Studs of players’ boots must conform with the IRB Specifications (Regulation 12).<br/><br/>(b) Moulded rubber multi-studded soles are acceptable provided they have no sharp edges or ridges."
                                }]
                      },
                      { "section" : "4.4 Banned items of clothing",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) A player must not wear any item that is contaminated by blood.<br/><br/>(b) A player must not wear any item that is sharp or abrasive.<br/><br/>(c) A player must not wear any items containing buckles, clips, rings, hinges, zippers, screws, bolts or rigid material or projection not otherwise permitted under this Law.<br/><br/>(d) A player must not wear jewellery such as rings or earrings.<br/><br/>(e) A player must not wear gloves.<br/><br/>(f) A player must not wear shorts with padding sewn into them.<br/><br/>(g) A player must not wear any other item which does not conform with the IRB Specifications for such clothing (Regulation 12).<br/><br/>(h) A player must not wear any item that is normally permitted by Law, but, in the referee’s opinion that is liable to cause injury to a player.<br/><br/>(i) A player must not wear communication devices within that player’s clothing or attached to the body.<br/><br/>(j) A player must not wear any additional item of clothing that does not conform to IRB Regulation 12."
                                }]
                      },
                      { "section" : "4.5 Inspection of players’ clothing",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) The referee or the touch judges appointed by or under the authority of the match organiser must inspect the players’ clothing and studs for conformity to this Law.<br/><br/>(b) The referee has power to decide at any time, before or during the match, that part of a player’s clothing is dangerous or illegal. If the referee decides that clothing is dangerous or illegal the referee must order the player to remove it. The player must not take part in the match until the items of clothing are removed.<br/><br/>(c) If, at an inspection before the match, the referee or a touch judge tells a player that an item banned under this Law is being worn, and the player is subsequently found to be wearing that item on the playing area, that player is sent off for misconduct.<br/><br/><font color=\"red\"><b>Sanction:</b> A penalty kick is awarded at the place where play is restarted.</font>"
                                }]
                      },
                      { "section" : "4.6 Wearing other clothing",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "The referee must not allow any player to leave the playing area to change items of clothing, unless these are bloodstained."
                                }]
                      }]
        },
        { "name" : "Law 5: - Time",
          "content" : [
                      { "section" : "5.1 Duration of a match",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A match lasts no longer than 80 minutes plus time lost, extra time and any special conditions. A match is divided into two halves each of not more than forty minutes playing time."
                                }]
                      },
                      { "section" : "5.2 Half-time",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "After half-time the teams change ends. There is an interval of not more than 15 minutes. The length of the interval is decided by the match organiser, the Union or the recognised body which has jurisdiction over the game. During the interval the teams, the referee and the touch judges may leave the playing enclosure."
                                }]
                      },
                      { "section" : "5.3 Time keeping",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "The referee keeps the time but may delegate the duty to either or both the touch judges and/or the official time-keeper, in which case the referee signals to them any stoppage of time or time lost. In matches without an official time-keeper, if the referee is in doubt as to the correct time the referee consults either or both the touch judges and may consult others but only if the touch judges cannot help."
                                }]
                      },
                      { "section" : "5.4 Time lost",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "Time lost may be due to the following:<br/><br/>(a) <b>Injury.</b> The referee may stop play for not more than one minute so that an injured player can be treated, or for any other permitted delay. The referee may allow play to continue while a medically trained person treats an injured player in the playing area or the player may go to the touchline for treatment."
                                },
                                { "type" : "video",
                                  "value" : "http://www.irblaws.com/videos/laws/2002-minor-injury.mp4"
                                },
                                { "type" : "text",
                                  "value" : "If a player is seriously injured and needs to be removed from the field of play, the referee has the discretion to allow the necessary time to have the injured player removed from the field-of-play.<br/><br/>(b) <b>Replacing players’ clothing.</b> When the ball is dead, the referee allows time for a player to replace or repair a badly torn jersey, shorts or boots. Time is allowed for a player to re-tie a boot-lace.<br/><br/>(c) <b>Replacement and substitution of players.</b> Time is allowed when a player is replaced or substituted.<br/><br/>(d) <b>Referee consulting with assistant referee(s) or other officials.</b> Time is allowed for consultations between referee and assistant referees or other officials."
                                }]
                      },
                      { "section" : "5.5 Making up for time lost",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "Any playing time lost is made up in the same half of the match."
                                }]
                      },
                      { "section" : "5.6 Playing extra time",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "A match may last more than eighty minutes if the Match Organiser has authorised the playing of extra time in a drawn match in a knock-out competition."
                                }]
                      },
                      { "section" : "5.7 Other time regulations",
                        "sectioncontents" : [
                                { "type" : "sectionheader",
                                  "value" : ""
                                },
                                { "type" : "text",
                                  "value" : "(a) In international matches, play always lasts eighty minutes plus lost time.<br/><br/>(b) In non-international matches a Union may decide the length of a match.<br/><br/>(c) If the Union does not decide, the teams agree on the length of a match. If they cannot agree, the referee decides.<br/><br/>(d) The referee has the power to end the match at any time, if the referee believes that play should not continue because it would be dangerous.<br/><br/>(e) If time expires and the ball is not dead, or an awarded scrum or lineout has not been completed, the referee allows play to continue until the next time that the ball becomes dead. The ball becomes dead when the referee would have awarded a scrum, lineout, an option to the non-infringing team, drop out or after a conversion or successful penalty kick at goal. If a scrum has to be reset, the scrum has not been completed. If time expires and a mark, free kick or penalty kick is then awarded, the referee allows play to continue.<br/><br/>(f) If time expires after a try has been scored the referee allows time for the conversion kick to be taken.<br/><br/>(g) When weather conditions are exceptionally hot and/or humid, the referee, at his discretion, will be permitted to allow one water break in each half. This water break should be no longer than one minute. Time lost should be added on at the end of each half. The water break should normally be taken after a score or when the ball is out of play near the half way line."
                                }]
                      }]
        },
        { "name" : "Law 6: - Match Officials",
          "content" : [
                      { "section" : "Definitions",
                        "sectioncontents" : [
                                    { "type" : "definition",
                                      "value" : "<b>DEFINITIONS</b><br/><br/>Every match is under the control of Match Officials who consist of the referee and two touch judges or assistant referees. Additional persons, as authorised by the match organisers may include the reserve referee and/or reserve assistant referee, an official to assist the referee in making decisions by using technological devices, the time keeper, the match doctor, the team doctors, the non-playing members of the teams and the ball persons.<br/><br/>A touch judge may be appointed by a match organiser or a team involved in a match and is responsible for signalling, touch, touch in-goal and the success or otherwise of kicks at goal.<br/><br/>An assistant referee may be appointed by a match organiser and is responsible for signalling, touch, touch in-goal, the success or otherwise of kicks at goal and indicating foul play. An assistant referee will also provide assistance to the referee in the performance of any of the referee’s duties as directed by the referee."
                                    }]
                      },

                      { "section" : "6.A.1 Appointing the referee",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><b>6.A REFEREE</b><br/><br/><i>Before the match</i></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The referee is appointed by the match organiser. If no referee has been appointed the two teams may agree upon a referee. If they cannot agree, the home team appoints a referee."
                                    }]
                      },
                      { "section" : "6.A.2 Replacing the referee",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "If the referee is unable to complete the match, the referee’s replacement is appointed according to the instructions of the match organiser. If the match organiser has given no instructions, the referee appoints the replacement. If the referee cannot do so, the home team appoints a replacement."
                                    }]
                      },
                      { "section" : "6.A.3 Duties of the referee before the match",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Toss.</b> The referee organises the toss. One of the captains tosses a coin and the other captain calls to see who wins the toss. The winner of the toss decides whether to kick off or to choose an end. If the winner of the toss decides to choose an end, the opponents must kick off and vice versa."
                                    }]
                      },
                      { "section" : "6.A.4 The duties of the referee in the playing enclosure",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><i>During the match</i></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The referee is the sole judge of fact and of Law during a match. The referee must apply fairly all the Laws of the Game in every match.<br/><br/>(b) The referee keeps the time.<br/><br/>(c) The referee keeps the score."
                                    }]
                      },
                      { "section" : "6.A.5 Entering or leaving the playing area",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) Authorised medically trained persons may enter the playing area during the match to attend to injured players. They must only enter the playing area if it is safe to do so.<br/><br/>(b) Persons carrying water for the players may only enter the playing area during a stoppage in play for an injury to a player.<br/><br/>(c) A person carrying a kicking tee may enter the field of play after a team has indicated that they intend to kick at goal after that team has been awarded a penalty kick or scored a try.<br/><br/>(d) The referee gives permission to the players to leave the playing area.<br/><br/>(e) The referee gives permission to the replacements or substitutes to enter the playing area.<br/><br/>(f) The coaches may enter the playing area at half-time to attend to their teams."
                                    }]
                      },
                      { "section" : "6.A.6 Referee altering a decision",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The referee may alter a decision when a touch judge has raised the flag to signal touch.<br/><br/>The referee may alter a decision when an assistant referee has raised the flag to signal touch or an act of foul play."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2003-ref-alters-decision.mp4"
                                    }]
                      },
                      { "section" : "6.A.7 Referee consulting with others",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The referee may consult with assistant referees about matters relating to their duties, the Law relating to foul play or timekeeping and may request assistance related to other aspects of the referee’s duties including the adjudication of offside."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2004-foul-play.mp4"
                                    },
                                    { "type" : "amendment",
                                      "value" : "<b><font color=\"red\">LAW AMENDMENT TRIAL</font></b><br/><br/>(b) A match organiser may appoint an official known as a Television Match Official (TMO) who uses technological devices to clarify situations relating to;<br/><br/>&emsp;(i) When there is doubt as to whether a ball has been grounded in in-goal for a score or a touchdown.<br/><br/>&emsp;(ii) Where there is doubt as to whether a kick at goal has been successful.<br/><br/>&emsp;(iii) Where there is doubt as to whether players were in touch or touch in goal before grounding the ball in in-goal or the ball has been made dead.<br/><br/>&emsp;(iv) Where match officials believe an offence or infringement may have occurred in the field of play leading to a try or preventing a try.<br/><br/>&emsp;(v) Reviewing situations where match officials believe foul play may have occurred.<br/><br/>&emsp;(vi) Clarifying sanctions required for acts of foul play.<br/><br/>(c) Any of the match officials including the TMO may recommend a review by the TMO. The reviews will take place in accordance with the TMO protocol in place at the time which will be available at www.irb.com/laws."
                                    },
                                    { "type" : "text",
                                      "value" : "(d) A match organiser may appoint a timekeeper who will signify the end of each half.<br/><br/>(e) The referee must not consult with any other persons."
                                    }]
                      },
                      { "section" : "6.A.8 The referee’s whistle",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The referee must carry a whistle and blow the whistle to indicate the beginning and end of each half of the match.<br/><br/>(b) The referee has the power to blow the whistle and stop play at any time.<br/><br/>(c) The referee must blow the whistle to indicate a score, or a touch down.<br/><br/>(d) The referee must blow the whistle to stop play because of an infringement or for an offence of foul play. When the referee cautions or sends off the offender, the referee must whistle a second time when the penalty kick or penalty try is awarded.<br/><br/>(e) The referee must blow the whistle when the ball has gone out of play, or when it has become unplayable, or when a penalty is awarded.<br/><br/>(f) The referee must blow the whistle when it would be dangerous to let play continue or when it is probable that a player has been seriously injured."
                                    }]
                      },
                      { "section" : "6.A.9 The referee and injury",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "If the referee stops play because a player has been injured, and there has been no infringement and the ball has not been made dead, play restarts with a scrum. The team last in possession throws in the ball. If neither team was in possession, the attacking team throws in the ball."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2013-injury.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2012-injury.mp4"
                                    }]
                      },
                      { "section" : "6.A.10 The ball touching the referee",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) If the ball or the ball carrier touches the referee and neither team gains an advantage, play continues. If either team gains an advantage in the field of play, the referee orders a scrum and the team that last played the ball has the throw-in."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2014-ball-hits-ref.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) If either team gains an advantage in in-goal, if the ball is in possession of an attacking player the referee awards a try where the contact took place.<br/><br/>(c) If either team gains an advantage in in-goal, if the ball is in possession of a defending player, the referee awards a touch down where the contact took place."
                                    }]
                      },
                      { "section" : "6.A.11 The ball in in-goal touched by non-player",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The referee judges what would have happened next and awards a try or a touch down at the place where the ball was touched."
                                    }]
                      },
                      { "section" : "6.A.12 Score",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><i>After the match</i></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The referee communicates the score to the teams and to the match organiser."
                                    }]
                      },
                      { "section" : "6.A.13 Player sent-off",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "If a player is sent off the referee gives the match organiser a written report on the foul play infringement as soon as possible."
                                    }]
                      },
                      { "section" : "6.B.1 Appointing touch judges and assistant referees",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><b>6.B TOUCH JUDGES AND ASSISTANT REFEREES</b><br/><br/><i>Before the match</i></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "There are two touch judges or two assistant referees for every match. Unless they have been appointed by or under the authority of the match organiser, each team provides a touch judge."
                                    }]
                      },
                      { "section" : "6.B.2 Replacing a touch judge or assistant referee",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The match organiser may nominate a person to act as a replacement for the referee, the touch judges or assistant referees. This person is called the reserve touch judge or reserve assistant referee and stands in the perimeter area."
                                    }]
                      },
                      { "section" : "6.B.3 Control of touch judges and assistant referees",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The referee has control over both touch judges or assistant referees. The referee may tell them what their duties are, and may overrule their decisions. If a touch judge is unsatisfactory the referee may ask that the touch judge be replaced. If the referee believes a touch judge is guilty of misconduct, the referee has power to send the touch judge off and make a report to the match organiser."
                                    }]
                      },
                      { "section" : "6.B.4 Where the touch judges or assistant referees should be",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><i>During the match</i></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) There is one touch judge or assistant referee on each side of the ground. The touch judge or assistant referee remains in touch except when judging a kick at goal. When judging a kick at goal the touch judges or assistant referees stand in in-goal behind the goal posts.<br/><br/>(b) An assistant referee may enter the playing area when reporting an offence of dangerous play or misconduct to the referee. The assistant referee may do this only at the next stoppage in play."
                                    }]
                      },
                      { "section" : "6.B.5 Touch judge or assistant referee signals",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) Each touch judge or assistant referee carries a flag or something similar with which to signal decisions.<br/><br/>(b) <b>Signalling result of kick at goal.</b> When a conversion kick or a penalty kick at goal is being taken, the touch judges or assistant referees must help the referee by signalling the result of the kick. One touch judge or assistant referee stands at or behind each goal post. If the ball goes over the crossbar and between the posts, the touch judges or assistant referees raise the flags to indicate a goal."
                                    },
                                    { "type" : "image",
                                      "value" : "kick_at_goal_successful",
                                      "extras" : "<b>Kick at goal successful</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2015-signalling-kick.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Signalling touch.</b> When the ball or the ball carrier has gone into touch, the touch judge or assistant referee must hold up the flag. The touch judge or assistant referee must stand at the place of the throw-in and point to the team entitled to throw in. The touch judge or assistant referee must also signal when the ball or the ball carrier has gone into touch-in-goal."
                                    },
                                    { "type" : "image",
                                      "value" : "touch_and_throw",
                                      "extras" : "<b>Signalling touch and team to throw in</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2016-signalling-touch.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(d) <b>When to lower the flag.</b> When the ball is thrown in, the touch judge or assistant referee must lower the flag, with the following exceptions:<br/><br/><b>&emsp;Exception 1:</b> When the player throwing in puts any part of either foot in the field of play, the touch judge or assistant referee keeps the flag up.<br/><br/><b>&emsp;Exception 2:</b> When the team not entitled to throw in has done so, the touch judge or assistant referee keeps the flag up.<br/><br/><b>&emsp;Exception 3:</b> When, at a quick throw-in, the ball that went into touch is replaced by another ball, or after it went into touch or it has been touched by anyone except the player who takes the throw-in, the touch judge or assistant referee keeps the flag up.<br/><br/>(e) It is for the referee, and not the touch judge or assistant referee, to decide whether or not the ball was thrown in from the correct place.<br/><br/>(f) <b>Signalling foul play.</b> An assistant referee signals that foul play or misconduct has been seen by holding the flag horizontally and pointing infield at right angles to the touchline."
                                    },
                                    { "type" : "image",
                                      "value" : "foul_play",
                                      "extras" : "<b>Signalling foul play</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2017-signalling-foul-play.mp4"
                                    }]
                      },
                      { "section" : "6.B.6 After signalling foul play",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "A match organiser may give authority to the assistant referee to signal for foul play. If an assistant referee signals foul play, the assistant referee must stay in touch and continue to carry out all the other duties until the next stoppage in play. At the invitation of the referee the assistant referee may then enter the playing area to report the offence to the referee. The referee may then take whatever action is needed. Any sanction awarded will be in accordance with Law 10 – Foul Play."
                                    }]
                      },
                      { "section" : "6.B.7 Player sent-off",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><i>After the match</i></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "If a player has been sent-off following an assistant referee’s signal and report to the referee, the assistant referee submits a written report about the incident to the referee as soon as possible after the match and provides it to the match organiser."
                                    }]
                      },
                      { "section" : "6.C.1 Reserve touch judge or assistant referee",
                        "sectioncontents" : [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><b>6.C ADDITIONAL PERSONS</b></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "When a reserve touch judge or assistant referee is appointed, the referee’s authority regarding replacements and substitutions may be delegated to the reserve touch judge or reserve assistant referee."
                                    }]
                      },
                      { "section" : "6.C.2 Those who may enter the playing area",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The match doctor and the non-playing members of the team may enter the playing area as authorised by the referee."
                                    }]
                      },
                      { "section" : "6.C.3 Limits to entering the playing area",
                        "sectioncontents" : [
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "In the case of injury, these persons may enter the playing area while play continues, provided they have permission from the referee. Otherwise, they enter only when the ball is dead."
                                    }]
                      }]
        }
    ]
}