{
    "laws" : [
        { "name" : "Law 7: - Mode of Play",
          "content" : [ {"section" : "7.1 Playing a match",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "A match is started by a kick-off.<br/><br/>After the kick-off, any player who is onside may take the ball and run with it.<br/><br/>Any player may throw it or kick it.<br/><br/>Any player may give the ball to another player.<br/><br/>Any player may tackle, hold or push an opponent holding the ball.<br/><br/>Any player may fall on the ball.<br/><br/>Any player may take part in a scrum, ruck, maul or lineout.<br/><br/>Any player may ground the ball in in-goal.<br/><br/>A ball carrier may hand-off an opponent.<br/><br/>Whatever a player does must be in accordance with the Laws of the Game."
                                    }]
                         }]
        },
        { "name" : "Law 8: - Advantage",
          "content" : [ {"section" : "Definitions",
                         "sectioncontents": [
                                    { "type": "definition",
                                      "value" : "<b>DEFINITIONS</b><br/><br/>The Law of advantage takes precedence over most other Laws and its purpose is to make play more continuous with fewer stoppages for infringements. Players are encouraged to play to the whistle despite infringements by their opponents. When the result of an infringement by one team is that their opposing team may gain an advantage, the referee does not whistle immediately for the infringement."
                                    }]
                         },
                         {"section" : "8.1 Advantage in practice",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The referee is sole judge of whether or not a team has gained an advantage. The referee has wide discretion when making decisions.<br/><br/>(b)Advantage can be either territorial or tactical.<br/><br/>(c) Territorial advantage means a gain in ground.<br/><br/>(d) Tactical advantage means freedom for the non-offending team to play the ball as they wish."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2100-tactical-advantage.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2101-tactical-advantage.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2102-tactical-advantage.mp4"
                                    }]
                         },
                         {"section" : "8.2 When advantage does not arise",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The advantage must be clear and real. A mere opportunity to gain advantage is not enough. If the non-offending team does not gain an advantage, the referee blows the whistle and brings play back to the place of infringement."
                                    }]
                         },
                         {"section" : "8.3 When the advantage law is not applied",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Referee contact.</b> Advantage must not be applied when the ball, or a player carrying it, touches the referee.<br/><br/>(b) <b>Ball out of tunnel.</b> Advantage must not be applied when the ball comes out of either end of the tunnel at a scrum without having been played.<br/><br/>(c) <b>Wheeled scrum.</b> Advantage must not be applied when the scrum is wheeled through more than 90 degrees (so that the middle line has passed beyond a position parallel to the touchline).<br/><br/>(d) <b>Collapsed scrum.</b> Advantage must not be applied when a scrum collapses. The referee must blow the whistle immediately.<br/><br/>(e) <b>Player lifted in the air.</b> Advantage must not be applied when a player in a scrum is lifted in the air or forced upwards out of the scrum. The referee must blow the whistle immediately.<br/><br/>(f) <b>After the ball has been made dead.</b> Advantage cannot be played after the ball has been made dead"
                                    }]
                         },
                         {"section" : "8.4 Immediate whistle when no advantage",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "The referee blows the whistle having determined that an advantage cannot be gained by the non-offending team."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2103-immediate-whistle.mp4"
                                    }]
                         },
                         {"section" : "8.5 More than one infringement",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) When there is more than one infringement by the same team:<br/><br/>&emsp;- If advantage cannot be played or does not accrue to the second offence, the referee applies the appropriate sanction to the offence which is most advantageous to the non-offending team.<br/><br/>&emsp;- If either sanction is for foul play the referee applies the appropriate sanction to the offence which is most advantageous to the non-offending team. The referee may also temporarily suspend, or order off, the offending player.<br/><br/>(b) If advantage is being played following an infringement by one team and then the other team commit an infringement, the referee blows the whistle and applies the sanctions associated with the first infringement. If either infringement is for foul play, the referee applies the appropriate sanction for that offence. The referee may also temporarily suspend, or order off, the offending player."
                                    }]
                         }]
        },
        { "name" : "Law 9: - Method of Scoring",
          "content" : [ {"section" : "9.A.1 Point values",
                         "sectioncontents": [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><b>9.A SCORING POINTS</b></font>"
                                    },
                                    { "type" : "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "<b>Try.</b> When an attacking player is first to ground the ball in the opponents’ in-goal, a try is scored.<br/><b>VALUE: 5 points</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2018-try.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<b>Penalty Try.</b> If a player would probably have scored a try but for foul play by an opponent, a penalty try is awarded between the goal posts.<br/><b>VALUE: 5 points</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2019-penalty-try.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<b>Conversion Goal.</b> When a player scores a try it gives the player’s team the right to attempt to score a goal by taking a kick at goal; this also applies to a penalty try. This kick is a conversion kick: a conversion kick can be a place kick or a drop kick.<br/><b>VALUE: 2 points</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2020-conversion.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<b>Penalty Goal.</b> A player scores a penalty goal by kicking a goal from a penalty kick.<br/><b>VALUE: 3 points</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2022-penalty-goal.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<b>Dropped Goal.</b> A player scores a dropped goal by kicking a goal from a drop kick in general play. The team awarded a free kick cannot score a dropped goal until the ball next becomes dead, or until an opponent has played or touched it, or has tackled the ball carrier. This restriction applies also to a scrum taken instead of a free kick.<br/><b>VALUE: 3 points</b>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2021-dropped-goal.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2104-drop-goal.mp4"
                                    }]
                         },
                         {"section" : "9.A.2 Kick at goal - special circumstances",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) If after the ball is kicked, it touches the ground or any team-mate of the kicker, a goal cannot be scored.<br/><br/>(b) If the ball has crossed the crossbar a goal is scored, even if the wind blows it back into the field of play.<br/><br/>(c) If an opponent commits an offence as the kick at goal is being taken, but neverthless the kick is successful, advantage is played and the score stands.<br/><br/>(d) Any player who touches the ball in an attempt to prevent a penalty goal being scored is illegally touching the ball.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    }]
                         },
                         {"section" : "9.B.1 Taking a conversion kick",
                         "sectioncontents": [
                                    { "type" : "text",
                                      "value" : "<font color=\"#008000\"><b>9.B CONVERSION KICK</b></font>"
                                    },
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The kicker must use the ball that was in play unless it is defective.<br/><br/>(b) The kick is taken on a line through the place where the try was scored in the field of play.<br/><br/>(c) A team mate may hold the ball for the kicker to kick.<br/><br/>(d) The kicker may place the ball directly on the ground or on sand, sawdust or a kicking tee approved by the Union. No other form of assistance may be used.<br/><br/>(e) The kicker must take the kick within one minute and thirty seconds (ninety seconds) from the time a try has been awarded. The player must take the kick within one minute and thirty seconds even if the ball rolls over and has to be placed again.<br/><font color=\"red\"><b>Sanction:</b>The kick is disallowed if the kicker does not take the kick within the time allowed.</font>"
                                    }]
                         },
                         {"section" : "9.B.2 The kicker's team",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) All the kicker’s team, except the placer, must be behind the ball when it is kicked.<br/><br/>(b) Neither the kicker nor a placer must do anything to mislead their opponents into charging too soon.<br/><br/>(c) If the ball falls over before the kicker begins the approach to kick, the referee permits the kicker to replace it without excessive delay. While the ball is replaced, the opponents must stay behind their goal line.<br/><br/>If the ball falls over after the kicker begins the approach to kick, the kicker may then kick or attempt a dropped goal.<br/><br/>If the ball falls over and rolls away from the line through the place where the try was scored, and the kicker then kicks the ball over the crossbar, a goal is scored.<br/><br/>If the ball falls over and rolls into touch after the kicker begins the approach to kick, the kick is disallowed.<br/><font color=\"red\"><b>Sanction:</b> (a)-(c) If the kicker’s team infringes, the kick is disallowed.</font>"
                                    }]
                         },
                         {"section" : "9.B.3 The opposing team",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) All players of the opposing team must retire to their goal line and must not overstep that line until the kicker begins the approach to kick or starts to kick. When the kicker does this, they may charge or jump to prevent a goal but must not be physically supported by other players in these actions.<br/><br/>(b) When the ball falls over after the kicker began the approach to kick, the opponents may continue to charge.<br/><br/>(c) A defending team must not shout during a kick at goal.<br/><font color=\"red\"><b>Sanction:</b> (a)-(c) If the opposing team infringes but the kick is successful, the goal stands.<br/><br/>If the kick is unsuccessful, the kicker may take another kick and the opposing team is not allowed to charge.</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2024-charging-conversion.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<font color=\"red\">When another kick is allowed, the kicker may repeat all the preparations. The kicker may change the type of kick.</font>"
                                    }]
                         }]
        },
        { "name" : "Law 10: - Foul Play",
          "content" : [ {"section" : "Definitions",
                         "sectioncontents": [
                                    { "type": "definition",
                                      "value" : "<b>DEFINITIONS <br/><br/>Foul play</b> is anything a player does within the playing enclosure that is against the letter and spirit of the Laws of the Game. It includes obstruction, unfair play, repeated infringements, dangerous play and misconduct which is prejudicial to the Game"
                                    }]
                         },
                         {"section" : "10.1 Obstruction",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Charging or pushing.</b> When a player and an opponent are running for the ball, either player must not charge or push the other except shoulder-to-shoulder.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2026-pushing.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Running in front of a ball carrier.</b> A player must not intentionally move or stand in front of a team-mate carrying the ball thereby preventing opponents from tackling the current ball carrier or the opportunity to tackle potential ball carriers when they gain possession.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2027-crossing.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Blocking the tackler.</b> A player must not intentionally move or stand in a position that prevents an opponent from tackling a ball carrier.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2028-blocking-tackler.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(d) <b>Blocking the ball.</b> A player must not intentionally move or stand in a position that prevents an opponent from playing the ball.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2029-blocking-ball.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(e) <b>Ball carrier running into team-mate.</b> A player carrying the ball must not intentionally run into team-mates in front of that player.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2030-running-into-team-mate.mp4"
                                    }]
                         },
                         {"section" : "10.2 Unfair play",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Intentionally Offending.</b> A player must not intentionally infringe any Law of the Game, or play unfairly. The player who intentionally offends must be either admonished, or cautioned that a send off will result if the offence or a similar offence is committed, or sent off.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2030-running-into-team-mate.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "A penalty try must be awarded if the offence prevents a try that would probably otherwise have been scored. A player who prevents a try being scored through foul play must either be cautioned and temporarily suspended or sent off."
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Time-wasting.</b> A player must not intentionally waste time.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2032-time-wasting.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Throwing into touch.</b> A player must not intentionally knock, place, push or throw the ball with his arm or hand into touch, touch-in-goal, or over the dead ball line.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick on the 15-metre line if the offence is between the 15-metre line and the touchline, or, at the place of infringement if the offence occured elsewhere in the field of play, or, 5 metres from the goal line and at least 15 metres from the touchline if the infringement occured in in-goal.</font><br/><br/>A penalty try must be awarded if the offence prevents a try that would probably otherwise have been scored."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2033-throwing-into-touch.mp4"
                                    }]
                         },
                         {"section" : "10.3 Repeated infringements",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Repeatedly offending.</b> A player must not repeatedly infringe any Law. Repeated infringement is a matter of fact. The question of whether or not the player intended to infringe is irrelevant.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font><br/><br/>A player penalised for repeated infringements must be cautioned and temporarily suspended."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2034-repeated-infringement.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Repeated infringements by the team.</b> When different players of the same team repeatedly commit the same offence, the referee must decide whether or not this amounts to repeated infringement. If it does, the referee gives a general warning to the team and if they then repeat the offence, the referee cautions and temporarily suspends the guilty player(s). If a player of that same team then repeats the offence the referee sends off the guilty player(s).<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2105-repeated-infringements.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "A penalty try must be awarded if the offence prevents a try that would probably otherwise have been scored."
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Repeated infringements: standard applied by referee.</b> When the referee decides how many offences constitute repeated infringement, the referee must always apply a strict standard in representative and senior matches. When a player offends three times the referee must caution that player.<br/><br/>The referee may relax this standard in junior or minor matches, where infringements may be the result of poor knowledge of the Laws or lack of skill."
                                    }]
                         },
                         {"section" : "10.4 Dangerous play and misconduct",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Punching or striking.</b> A player must not strike an opponent with the fist or arm, including the elbow, shoulder, head or knee(s).<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2035-striking-knee.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Stamping or trampling.</b> A player must not stamp or trample on an opponent.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Kicking.</b> A player must not kick an opponent.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2106-kicking.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(d) <b>Tripping.</b> A player must not trip an opponent with the leg or foot.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2107-tripping.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(e) <b>Dangerous tackling.</b> A player must not tackle an opponent early, late or dangerously.<br/><br/>A player must not tackle (or try to tackle) an opponent above the line of the shoulders even if the tackle starts below the line of the shoulders. A tackle around the opponent’s neck or head is dangerous play.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2036-high-tackle.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2037-high-tackle.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2108-high-tackle.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "A ‘stiff-arm tackle’ is dangerous play. A player makes a stiff-arm tackle when using a stiff-arm to strike an opponent.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2038-stiff-arm.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "Playing a player without the ball is dangerous play.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2039-opponent-without-ball.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "A player must not tackle an opponent whose feet are off the ground.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2040-tackle-off-ground.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(f) <b>Playing an opponent without the ball.</b> Except in a scrum, ruck or maul, a player who is not in possession of the ball must not hold, push or obstruct an opponent not carrying the ball.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2041-opponent-without-ball.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2109-late-tackle.mp4"
                                    },                            
                                    { "type" : "text",
                                      "value" : "(g) <b>Dangerous charging.</b> A player must not charge or knock down an opponent carrying the ball without trying to grasp that player.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2042-dangerous-charging.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(h) A player must not charge into a ruck or maul. Charging includes any contact made without use of the arms, or without grasping a player."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2043-ruck-charging.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2110-ruck-charging.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(i) <b>Tackling the jumper in the air.</b> A player must not tackle nor tap, push or pull the foot or feet of an opponent jumping for the ball in a lineout or in open play.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2044-tackle-in-air.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2045-tackle-in-air-lineout.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(j) Lifting a player from the ground and dropping or driving that player into the ground whilst that player's feet are still off the ground such that the player's head and/or upper body come into contact with the ground is dangerous play.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2046-lifting-tackle.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2047-lifting-tackle.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(k) <b>Dangerous play in a scrum, ruck or maul.</b> The front row of a scrum must not rush against its opponents.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "Front row players must not intentionally lift opponents off their feet or force them upwards out of the scrum.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "Players must not charge into a ruck or maul without binding onto a player in the ruck or maul.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "Players must not intentionally collapse a scrum, ruck or maul.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(l) <b>Retaliation.</b> A player must not retaliate. Even if an opponent is infringing the Laws, a player must not do anything that is dangerous to the opponent.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2049-retaliation.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(m) <b>Acts contrary to good sportsmanship.</b> A player must not do anything that is against the spirit of good sportsmanship in the playing enclosure.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2048-acts-contrary.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2111-bad-sportsmanship.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(n) <b>Misconduct while the ball is out of play.</b> A player, must not, while the ball is out of play, commit any misconduct, or obstruct or in any way interfere with an opponent.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2050-ball-out-of-play.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<br/><font color=\"red\">The sanction is the same as for sections 10.4 (a)-(m) except that the penalty kick is awarded at the place where play would restart. If that place is on the touchline or within 15 metres of it, the mark for the penalty kick is on the 15-metre line, in line with that place.</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2051-ball-out-of-play.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<br/><font color=\"red\">If play would restart at a 5-metre scrum, the mark for the penalty kick is at that place of the scrum.<br/><br/>If play would restart with a drop-out, the non-offending team may choose to take the penalty kick anywhere on the 22-metre line.<br/><br/>If a penalty kick is awarded but the offending team is guilty of further misconduct before the kick is taken, the referee cautions or orders off the guilty player and advances the mark for the penalty kick 10 metres. This covers both the original offence and the misconduct.</font><br/><br/>If a penalty kick is awarded to a team but a player of that team is guilty of further misconduct before the kick is taken, the referee will caution or send-off the guilty player, declare the kick disallowed, and award a penalty kick to the opposing team.<br/><br/>If an offence is committed outside the playing area while the ball is still in play, and if that offence is not covered by any other part of this Law, the penalty kick is awarded on the 15-metre line, in line with where the offence happened"
                                    },
                                    { "type" : "text",
                                      "value" : "(o) <b>Late-charging the kicker.</b> A player must not intentionally charge or obstruct an opponent who has just kicked the ball.<br/><font color=\"red\"><b>Sanction:</b> The non-offending team may choose to take the penalty kick either at the place of infringement, where the ball lands or or where it was next played.</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2052-late-charge-kicker.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2112-late-charge-kicker.mp4"
                                    },
                                    { "type" : "image",
                                      "images" : ["late_charging_the_kicker_en"]
                                    },
                                    { "type" : "text",
                                      "value" : "<b>Place of infringement.</b> If the infringement takes place in the kicker’s in-goal, the penalty kick is taken 5 metres from the goal line in line with the place of infringement but at least 15 metres from the touchline.<br/><br/>The non-offending team may also choose to take the penalty where the ball lands or is next played before landing and at least 15 metres from the touchline.<br/><br/><b>Where the ball lands.</b> If the ball lands in touch, the mark for the optional penalty kick is on the 15-metre line, in line with where it went into touch. If the ball lands, or is next played before landing, within 15 metres of the touchline, the mark is on the 15-metre line opposite where the ball landed or was played.<br/><br/>If the ball lands in the in-goal, in touch-in-goal, or on or over the dead ball line, the mark for the optional penalty kick is 5 metres from the goal line, in line with the place where the ball crossed the goal line and at least 15 metres from the touchline.<br/><br/>If the ball hits a goal post or crossbar, the optional penalty kick is awarded where the ball lands on the ground."
                                    },
                                    { "type" : "text",
                                      "value" : "(p) <b>Flying Wedge and Cavalry Charge.</b> A team must not use the \"Flying Wedge\" or the \"Cavalry Charge\".<br/><font color=\"red\"><b>Sanction:</b> Penalty kick at the place of the original infringement.</font><br/><br/><b>\"Flying Wedge\"</b>. The type of attack known as a \"Flying Wedge\" usually happens near the goal line, when the attacking team is awarded a penalty kick or free kick.<br/><br/>The kicker tap-kicks the ball and starts the attack, either by driving towards the goal line or by passing to a team-mate who drives forward. Immediately, team mates bind on each side of the ball carrier in a wedge formation. Often one or more of these team mates is in front of the ball carrier. A \"Flying Wedge\" is illegal.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick at the place of the original infringement.</font><br/><br/><b>\"Cavalry Charge\"</b>. The type of attack known as as a \"Cavalry Charge\" usually happens near the goal line, when the attacking team is awarded a penalty kick or free kick. Either a single player stands some distance behind the kicker, or attacking players form a line across the field some distance behind the kicker.<br/><br/>These attacking players are usually a metre or two apart. At a signal from the kicker, they charge forward. When they get near, the kicker tap-kicks the ball and passes to a player who had started some distance behind the kicker.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick at the place of the original infringement.</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(q) Advantage may be played for acts of foul play, but if the offence prevents a probable try, a penalty try must be awarded.<br/><br/>(r) For an offence reported by an assistant referee a penalty kick may be awarded where the offence occurred, or advantage may be played.<br/><br/>(s) All players must respect the authority of the referee. They must not dispute the referee’s decisions. They must stop playing at once when the referee blows the whistle except at a kick-off or at a penalty kick following admonishment, temporary suspension, or send-off.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2053-respect-authority.mp4"
                                    }]
                         },
                         {"section" : "10.5 Sanctions",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) Any player who infringes any part of the Foul Play Law must be admonished, or cautioned and temporarily suspended for a period of ten minutes’ playing time, or sent-off.<br/><br/>(b) A player who has been cautioned and temporarily suspended who then commits a second cautionable offence within the Foul Play Law must be sent-off."
                                    }]
                         },
                         {"section" : "10.6 Yellow and red cards",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) When a player has been cautioned and temporarily suspended in an International match the referee will show that player a yellow card.<br/><br/>(b) When a player has been sent off in an International match, the referee will show that player a red card.<br/><br/>(c) For other matches the Match Organiser or Union having jurisdiction over the match may decide upon the use of yellow and red cards."
                                    }]
                         },
                         {"section" : "10.7 Player sent off",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "A player who is sent-off takes no further part in the match."
                                    }]
                         }]
        },
        { "name" : "Law 11: - Offside and Onside in General Play",
          "content" : [ {"section" : "Definitions",
                         "sectioncontents": [
                                    { "type": "definition",
                                      "value" : "<b>DEFINITIONS</b><br/><br/>At the start of a game all players are onside. As the match progresses players may find themselves in an offside position. Such players are then liable to be penalised until they become onside again.<br/><br/>In general play a player is offside if the player is in front of a team-mate who is carrying the ball, or in front of a team-mate who last played the ball.<br/><br/>Offside means that a player is temporarily out of the game. Such players are liable to be penalised if they take part in the game.<br/><br/>In general play, a player can be put onside either by an action of a team-mate or by an action of an opponent. However, the offside player cannot be put onside if the offside player interferes with play; or moves forward, towards the ball, or fails to move 10 metres away from the place where the ball lands."
                                    }]
                         },
                         {"section" : "11.1 Offside in general play",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) A player who is in an offside position is liable to sanction only if the player does one of three things:<br/><br/>&emsp;- Interferes with play or,<br/><br/>&emsp;- Moves forward, towards the ball or<br/><br/>&emsp;- Fails to comply with the 10-Metre Law (Law 11.4).<br/><br/>A player who is in an offside position is not automatically penalised.<br/><br/>A player who receives an unintentional throw forward is not offside.<br/><br/>A player can be offside in the in-goal.<br/><br/>(b) <b>Offside and interfering with play.</b> A player who is offside must not take part in the game. This means the player must not play the ball or obstruct an opponent."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2113-offside-interfering.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Offside and moving forward.</b> When a team-mate of an offside player has kicked ahead, the offside player must not move towards opponents who are waiting to play the ball, or move towards the place where the ball lands, until the player has been put onside."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2054-offside-from-kick.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2114-offside-moving-forward.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "<font color=\"red\"><b>Sanction:</b> When a player is penalised for being offside in general play, the opposing team chooses either a penalty kick at the place of infringement or a scrum at the place where the offending team last played the ball. If it was last played in that team’s in-goal, the scrum is formed 5 metres from the goal line in line with where it was played.</font>"
                                    }]
                         },
                         {"section" : "11.2 Being put onside by the action of a team-mate",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "In general play, there are three ways by which an offside player can be put onside by actions of that player or of team mates:<br/><br/>(a) <b>Action by the player.</b> When the offside player runs behind the team-mate who last kicked, touched or carried the ball, the player is put onside.<br/><br/>(b) <b>Action by the ball carrier.</b> When a team-mate carrying the ball runs in front of the offside player, that player is put onside.<br/><br/>(c) <b>Action by the kicker or other onside player.</b> When the kicker, or team-mate who was level with or behind the kicker when (or after) the ball was kicked, runs in front of the offside player, the player is put onside. When running forward, the team-mate may be in touch or touch-in-goal, but that team-mate must return to the playing area to put the player onside."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2055-put-onside-by-kicker.mp4"
                                    },
                                    { "type" : "image",
                                      "images" : ["player_made_onside_en"],
                                      "extras" : "<b>Player made onside by team-mate</b>"
                                    }]
                         },
                         {"section" : "11.3 Being put onside by opponents",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "In general play, there are three ways by which an offside player can be put onside by an action of the opposing team. These three ways do not apply to a player who is offside under the 10-Metre Law.<br/><br/>(a) <b>Runs 5 metres with ball.</b> When an opponent carrying the ball runs 5 metres, the offside player is put onside."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2117-onside-opponent-runs-ball.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) <b>Kicks or passes.</b> When an opponent kicks or passes the ball, the offside player is put onside."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2118-onside-opponent-passes.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Intentionally touches ball.</b> When an opponent intentionally touches the ball but does not catch it, the offside player is put onside."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2056-intentionall-touches-ball.mp4"
                                    },
                                    { "type" : "image",
                                      "images" : ["player_put_onside"],
                                      "extras" : "<b>Player made onside by opponents</b>"
                                    }]
                         },
                         {"section" : "11.4 Offside under the 10-metre law",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) When a team-mate of an offside player has kicked ahead, the offside player is considered to be taking part in the game if the player is in front of an imaginary line across the field which is 10 metres from the opponent waiting to play the ball, or from where the ball lands or may land. The offside player must immediately move behind the imaginary 10-metre line or the kicker if this is closer than 10 metres. While moving away, the player must not obstruct an opponent or interfere with play.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2119-offside-within-10.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) While moving away, the offside player cannot be put onside by any action of the opposing team. However, before the player has moved the full 10 metres, the player can be put onside by any onside team-mate who runs in front of the player."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2058-players-leaving-10m.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) When a player who is offside under the 10-Metre Law charges an opponent waiting to catch the ball, the referee blows the whistle at once and the offside player is penalised. Delay may prove dangerous to the opponent.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(d) When a player who is offside under the 10-metre Law plays the ball which has been misfielded by an opponent, the offside player is penalised.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(e) The 10-metre Law is not altered by the fact that the ball has hit a goal post or a crossbar. What matters is where the ball lands. An offside player must not be in front of the imaginary 10-metre line across the field.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(f) The 10-metre Law does not apply when a player kicks the ball, and an opponent charges down the kick, and a team-mate of the kicker who was in front of the imaginary 10-metre line across the field then plays the ball. The opponent was not 'waiting to play the ball' and the team-mate is onside. The 10-metre Law applies if the ball touches or is played by an opponent but is not charged down.<br/><font color=\"red\"><b>Sanction:</b> When a player is penalised for being offside in general play, the opposing team chooses either a penalty kick at the place of infringement or a scrum at the place where the offending team last played the ball. If it was last played in that team’s in-goal, the scrum is formed 5 metres from the goal line in line with where it was played.</font>"
                                    },
                                    { "type" : "text",
                                      "value" : "(g) If more than one player is offside and moving forward after a team-mate has kicked ahead, the place of infringement is the position of the offside player closest to an opponent waiting for the ball, or closest to where the ball lands."
                                    }]
                         },
                         {"section" : "11.5 Being put onside under the 10-metre law",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) The offside player must retire behind the imaginary 10-metre line across the field, otherwise the player is liable to be penalised.<br/><br/>(b) While retiring, the player can be put onside before moving behind the imaginary 10-metre line by any of the three actions of the player’s team listed above in 11.2. However, the player cannot be put onside by any action of the opposing team."
                                    }]
                         },
                         {"section" : "11.6 Accidental offside",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) When an offside player cannot avoid being touched by the ball or by a team-mate carrying it, the player is accidentally offside. If the player’s team gains no advantage from this, play continues. If the player’s team gains an advantage, a scrum is formed with the opposing team throwing in the ball."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2220-accidental-offside.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2221-accidental-offside.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(b) When a player hands the ball to a team-mate in front of the first player, the receiver is offside. Unless the receiver is considered to be intentionally offside (in which case a penalty kick is awarded), the receiver is accidentally offside and a scrum is formed with the opposing team throwing in the ball."
                                    }]
                         },
                         {"section" : "11.7 Offside after a knock-on",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "When a player knocks-on and an offside team-mate next plays the ball, the offside player is liable to sanction if playing the ball prevented an opponent from gaining an advantage.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2222-offside-after-knock-on.mp4"
                                    }]
                         },
                         {"section" : "11.8 Putting onside a player retiring during a ruck, maul, scrum or lineout",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "When a ruck, maul, scrum or lineout forms, a player who is offside and is retiring as required by Law remains offside even when the opposing team wins possession and the ruck, maul, scrum or lineout has ended. The player is put onside by retiring behind the applicable offside line. No other action of the offside player and no action of that player's team mates can put the offside player onside.<br/><br/>If the player remains offside the player can be put onside only by the action of the opposing team. There are two such actions:<br/><br/><b>Opponent</b> runs 5 metres with ball. When an opponent carrying the ball has run 5 metres, the offside player is put onside. An offside player is not put onside when an opponent passes the ball. Even if the opponents pass the ball several times, their action does not put the offside player onside.<br/><br/><b>Opponent kicks.</b> When an opponent kicks the ball, the offside player is put onside."
                                    }]
                         },
                         {"section" : "11.9 Loitering",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "A player who remains in an offside position is loitering. A loiterer who prevents the opposing team from playing the ball as they wish is taking part in the game, and is penalised. The referee makes sure that the loiterer does not benefit from being put onside by the opposing team’s action.<br/><font color=\"red\"><b>Sanction:</b> Penalty kick at the offending player’s offside line</font>"
                                    }]
                         }]
        },
        { "name" : "Law 12: - Knock-on or Throw Forward",
          "content" : [ {"section" : "Definitions",
                         "sectioncontents": [
                                    { "type": "definition",
                                      "value" : "<b>DEFINITION</b><br/><br/>A <b>knock-on</b> occurs when a player loses possession of the ball and it goes forward, or when a player hits the ball forward with the hand or arm, or when the ball hits the hand or arm and goes forward, and the ball touches the ground or another player before the original player can catch it.<br/><br>\'Forward\' means towards the opposing team\'s dead ball line."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2059-knock-on.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2223-knock-on.mp4"
                                    },
                                    { "type" : "definition",
                                      "value" : "<b>EXCEPTION</b><br/><br/><b>Charge down.</b> If a player charges down the ball as an opponent kicks it, or immediately after the kick, it is not a knock-on even though the ball may travel forward."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2060-charge-down.mp4"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2224-knock-on-exception.mp4"
                                    },
                                    { "type" : "image",
                                      "images" : ["knockon"],
                                      "extras" : "<b>Knock-on</b>"
                                    },
                                    { "type": "definition",
                                      "value" : "<b>DEFINITION</b><br/><br/>A <b>throw forward</b> occurs when a player throws or passes the ball forward. \'Forward\' means towards the opposing team’s dead ball line."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2225-forward-pass.mp4"
                                    },
                                    { "type" : "definition",
                                      "value" : "<b>EXCEPTION</b><br/><br/><b>Bounce forward.</b> If the ball is not thrown forward but it hits a player or the ground and bounces forward, this is not a throw forward."
                                    },
                                    { "type" : "image",
                                      "images" : ["charge_down"],
                                      "extras" : "<b>Charge down</b>"
                                    }]
                         },
                         {"section" : "12.1 The outcome of a knock-on or throw forward",
                         "sectioncontents": [
                                    { "type": "sectionheader",
                                      "value" : ""
                                    },
                                    { "type" : "text",
                                      "value" : "(a) <b>Unintentional knock-on or throw forward.</b> A scrum is awarded at the place of infringement.<br/><br/>(b) <b>Unintentional knock-on or throw forward at a lineout.</b> A scrum is awarded 15 metres from the touchline."
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2226-knock-on-at-lineout.mp4"
                                    },
                                    { "type" : "text",
                                      "value" : "(c) <b>Knock-on or throw forward into the in-goal.</b> If an attacking player knocks-on or throws-forward in the field of play and the ball goes into the opponents’ in-goal and it is made dead there, a scrum is awarded where the knock-on or throw forward happened.<br/><br/>(d) <b>Knock-on or throw forward inside the in-goal.</b> If a player of either team knocks-on or throws-forward inside the in-goal, a 5-metre scrum is awarded in line with the place of infringement not closer than 5 metres from the touchline.<br/><br/>(e) <b>Knock-on or throw forward into touch.</b> When the ball goes into touch from a knock-on or throw forward, the non-offending team will have the option of a lineout at the point the ball crossed the touch line or a scrum at the place of the knock-on or throw forward, or a quick throw in.<br/><br/>(f) <b>Intentional knock or throw forward.</b> A player must not intentionally knock the ball forward with hand or arm, nor throw forward.<br/><font color=\"red\"><b>Sanction: </b>Penalty kick. A penalty try must be awarded if the offence prevents a try that would probably otherwise have been scored.</font>"
                                    },
                                    { "type" : "video",
                                      "value" : "http://www.irblaws.com/videos/laws/2061-intentional-knock-on.mp4"
                                    }]
                         }]
        }
    ]
}